<a href="https://colab.research.google.com/github/keto08/Employee-Retention-Analysis/blob/master/Employee_Retention.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Employee Retention Case Study - Figuring out which employees may quit and who would stay

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
#loading employee data
file_name = "https://raw.githubusercontent.com/keto08/Employee-Retention-Analysis/master/hr_data.csv"
hr_df = pd.read_csv(file_name)
hr_df#.head()

       employee_id  number_project  ...  department  salary
0             1003               2  ...       sales     low
1             1005               5  ...       sales  medium
2             1486               7  ...       sales  medium
3             1038               5  ...       sales     low
4             1057               2  ...       sales     low
...            ...             ...  ...         ...     ...
14994        87670               2  ...     support     low
14995        87673               2  ...     support     low
14996        87679               2  ...     support     low
14997        87681               6  ...     support     low
14998        87684               2  ...     support     low

[14999 rows x 9 columns]

In [ ]:
hr_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            14999 non-null  int64
 1   number_project         14999 non-null  int64
 2   average_montly_hours   14999 non-null  int64
 3   time_spend_company     14999 non-null  int64
 4   Work_accident          14999 non-null  int64
 5   left                   14999 non-null  int64
 6   promotion_last_5years  14999 non-null  int64
 7   department             14999 non-null  object
 8   salary                 14999 non-null  object
dtypes: int64(7), object(2)
memory usage: 1.0+ MB

In [ ]:
# View columns that are categorical
hr_df.select_dtypes(exclude=['int', 'float']).columns

Index(['department', 'salary'], dtype='object')

In [ ]:
#loading employee satisfaction data
file_name = "https://raw.githubusercontent.com/keto08/Employee-Retention-Analysis/master/employee_satisfaction_evaluation.xlsx"
emp_sat = pd.read_excel(file_name)
emp_sat#.head()

       EMPLOYEE #  satisfaction_level  last_evaluation
0            1003                0.38             0.53
1            1005                0.80             0.86
2            1486                0.11             0.88
3            1038                0.72             0.87
4            1057                0.37             0.52
...           ...                 ...              ...
14994       87670                0.40             0.57
14995       87673                0.37             0.48
14996       87679                0.37             0.53
14997       87681                0.11             0.96
14998       87684                0.37             0.52

[14999 rows x 3 columns]

### Join both tables

In [ ]:
main_df = hr_df.set_index('employee_id').join(emp_sat.set_index('EMPLOYEE #'))
main_df = main_df.reset_index()
main_df.head()

   employee_id  number_project  ...  satisfaction_level  last_evaluation
0         1003               2  ...                0.38             0.53
1         1005               5  ...                0.80             0.86
2         1486               7  ...                0.11             0.88
3         1038               5  ...                0.72             0.87
4         1057               2  ...                0.37             0.52

[5 rows x 11 columns]

In [ ]:
#checking for null values
main_df[main_df.isnull().any(axis=1)]

       employee_id  number_project  ...  satisfaction_level  last_evaluation
18            3794               2  ...                 NaN              NaN
19            1140               5  ...                 NaN             0.89
33            1230               2  ...                 NaN              NaN
53            1340               2  ...                 NaN              NaN
72           22316               2  ...                 NaN              NaN
92            1581               2  ...                 NaN              NaN
107          17376               2  ...                 NaN              NaN
120           1739               4  ...                 NaN              NaN
137           1847               2  ...                 NaN              NaN
175          32923               4  ...                 NaN              NaN
191           2160               4  ...                0.92              NaN
352           3150               4  ...                 NaN             0.91
376           3250               4  ...                0.56              NaN
402           3405               5  ...                 NaN             1.00
427          78130               3  ...                 NaN             0.60
442           3635               5  ...                0.77              NaN
468           3755               5  ...                 NaN             0.92
543           4150               5  ...                0.89              NaN
892          43615               4  ...                0.74              NaN
1588         42185               5  ...                 NaN             0.81
1934         11895               4  ...                0.78              NaN
2343         14170               3  ...                 NaN             0.97
2743         16445               5  ...                0.62              NaN
3170         18980               5  ...                 NaN              NaN
3609         21580               3  ...                0.95              NaN
3776         22555               4  ...                 NaN             0.68
4122         24505               3  ...                0.86              NaN
4740         27950               3  ...                 NaN             0.95
5028         29640               4  ...                0.64              NaN
6453         38090               5  ...                 NaN             0.78
7005         41535               4  ...                0.82              NaN
7516         44460               4  ...                 NaN             0.97
8630         50960               4  ...                0.90              NaN
9455         55770               4  ...                 NaN             0.88
9901         58630               5  ...                0.92              NaN
10647        62595               4  ...                 NaN             0.69
10962        64350               5  ...                0.65              NaN
11575        20215               3  ...                 NaN              NaN
11967        70005               3  ...                0.82              NaN
12422        72475               5  ...                 NaN             1.00
12853        74880               3  ...                 NaN             0.70
13482        78780               3  ...                0.58              NaN
13925        81315               3  ...                 NaN             0.75

[43 rows x 11 columns]

##### so we have few NaN values in the evaluation part, which will have to be filled by the general mean of all values

In [ ]:
main_df.describe()

        employee_id  number_project  ...  satisfaction_level  last_evaluation
count  14999.000000    14999.000000  ...        14972.000000     14972.000000
mean   45424.627575        3.803054  ...            0.612830         0.716125
std    25915.900127        1.232592  ...            0.248714         0.171138
min     1003.000000        2.000000  ...            0.090000         0.360000
25%    22872.500000        3.000000  ...            0.440000         0.560000
50%    45448.000000        4.000000  ...            0.640000         0.720000
75%    67480.500000        5.000000  ...            0.820000         0.870000
max    99815.000000        7.000000  ...            1.000000         1.000000

[8 rows x 9 columns]

In [ ]:
main_df.fillna(main_df.mean(), inplace=True)
main_df.head()

   employee_id  number_project  ...  satisfaction_level  last_evaluation
0         1003               2  ...                0.38             0.53
1         1005               5  ...                0.80             0.86
2         1486               7  ...                0.11             0.88
3         1038               5  ...                0.72             0.87
4         1057               2  ...                0.37             0.52

[5 rows x 11 columns]

In [ ]:
main_df[main_df.isnull().any(axis=1)]

Empty DataFrame
Columns: [employee_id, number_project, average_montly_hours, time_spend_company, Work_accident, left, promotion_last_5years, department, salary, satisfaction_level, last_evaluation]
Index: []

In [ ]:
# don't need a unique value like employee ID
main_df_final = main_df.drop(columns='employee_id')
main_df_final.head()

   number_project  average_montly_hours  ...  satisfaction_level  last_evaluation
0               2                   157  ...                0.38             0.53
1               5                   262  ...                0.80             0.86
2               7                   272  ...                0.11             0.88
3               5                   223  ...                0.72             0.87
4               2                   159  ...                0.37             0.52

[5 rows x 10 columns]

#### EDA

In [ ]:
main_df_final.groupby('department').sum()

             number_project  ...  last_evaluation
department                   ...
IT                     4683  ...       879.452250
RandD                  3033  ...       560.446125
accounting             2934  ...       550.706125
hr                     2701  ...       524.006125
management             2432  ...       456.234499
marketing              3164  ...       613.946125
product_mng            3434  ...       644.662250
sales                 15634  ...      2938.236749
support                8479  ...      1611.534499
technical             10548  ...      1961.930624

[10 rows x 8 columns]

In [ ]:
main_df_final.groupby('department').mean()

             number_project  ...  last_evaluation
department                   ...
IT                 3.816626  ...         0.716750
RandD              3.853875  ...         0.712130
accounting         3.825293  ...         0.718000
hr                 3.654939  ...         0.709075
management         3.860317  ...         0.724182
marketing          3.687646  ...         0.715555
product_mng        3.807095  ...         0.714703
sales              3.776329  ...         0.709719
support            3.803948  ...         0.722985
technical          3.877941  ...         0.721298

[10 rows x 8 columns]

In [ ]:
main_df_final['department'].value_counts().to_frame()

             department
sales              4140
technical          2720
support            2229
IT                 1227
product_mng         902
marketing           858
RandD               787
accounting          767
hr                  739
management          630

In [ ]:
main_df_final['left'].value_counts()

0    11428
1     3571
Name: left, dtype: int64

In [1]:
#corelation matrix
def plot_corr(df,size=10):
    corr = df.corr()
    fig, ax = plt.subplots(figsize=(size, size))
    ax.legend()
    cax = ax.matshow(corr)
    fig.colorbar(cax)
    plt.xticks(range(len(corr.columns)), corr.columns, rotation='vertical')
    plt.yticks(range(len(corr.columns)), corr.columns)
    
plot_corr(main_df_final)

NameError: ignored

##### time spend and left are strongly related while satisfaction level and left are weakly related - makes sense

#### Let's prepare the dataset for modelling